print("""
        ,=""=,
       c , _,{
       /\  @ )                 __
      /  ^~~^\          <=.,__/ '}=
     (_/ ,, ,,)          \_ _>_/~
      ~\_(/-\)'-,_,_,_,-'(_)-(_)  -Naughty
""")

print("Добро пожаловать в игру, непослушный утёнок.")
print("Твоя задача выгулять утёнка.")

first_choice = input(
    "Вы пошли в лес и заблудились , вот вы на развилке , куда вы пойдете, направо или налево?\n").lower()

if first_choice == 'налево':
    second_choice = input(
        "Вы вышли к большому озеро и в далеке видите , что к вам огромный катер, но сзади вас на вершине холма вы увидели волка, вы будете катер ждать или плыть к нему?\n").lower()

    if second_choice == 'ждать':
        third_choice = input(
            "К вам подплывает катер, у него три двери , синяя, желтая и красная, какую ты выберешь ? Но поторопись волк уже спустился с холма.\n").lower()

        if third_choice == 'желтая':
            print("Вы зашли на потрясающий катер , там есть все что угодно , еда , напитки , зона отдыха , вы поплыли и отлично провели время.\n")
        elif third_choice == 'синяя':
            print(
                "Вы открыли дверь и там оказалась дырка , уточка провалилась и ее сьел крокодил. Конец.")
        elif third_choice == 'красная':
            print("Там оказалась комната лисы и она скушала бедную уточку. Конец.")
        else:
            print("Такой двери не существует. Конец.")

    else:
        print("Вы поплыли к лодке и бедную уточку сьел крокодил. Конец")

else:
    print("Там оказалось логово медведя и он сьел уточку. Ты проиграл.")
